"""
python中的集合支持数学相关的集合运算

"""
# 1.包含关系
"""
集合1 >= 集合2  判断集合1是否包含集合2（判断集合2是否是集合1的子集）
集合1 <= 集合2  判断集合2是否包含集合1（判断集合1是否是集合2的子集）
"""
print({1,2,3} >= {1,2}) #True
print({1,2,3} <= {1,2}) #False

# 2.求并集
"""
集合1 | 集合2 - 将两个集合的元素合并在一起产生一个新的集合

"""
set1 = {1,2,3,4,5,6}
set2 = {4,5,6,7,8,9}
print(set1 | set2)  # {1, 2, 3, 4, 5, 6, 7, 8, 9}

# 3.求交集
"""
集合1 & 集合2 - 使用两个集合公共的元素产生一个新的集合
"""
set1 = {1,2,3,4,5,6}
set2 = {4,5,6,7,8,9}
print(set1&set2) #{4, 5, 6}

# 4.求差集
"""
集合1 - 集合2   = 集合1中除了与集合2中公共的部分剩下的部分
"""
set1 = {1,2,3,4,5,6}
set2 = {4,5,6,7,8,9}
print(set1-set2) #{1, 2, 3}

# 5.求补集
"""
集合1 ^ 集合2 - 使用两个集合中除了公共部分以外的元素，创建一个新的集合
"""
set1 = {1,2,3,4,5,6}
set2 = {4,5,6,7,8,9}
print(set1^set2) #{1, 2, 3, 7, 8, 9}
