"""__author__ = 余婷"""

"""
1.变量
变量名 = 值

变量存的是地址

2.运算符：

3.字符串
字符
获取字符
运算
相关方法

4.if
if
if-else
if-elif-else

5.for\while
for 变量 in 序列：
    循环体
else:
    代码段
执行过程:

while 条件语句:
    循环体
else:
    代码段
执行过程:

continue和break
else
"""
name = '余婷'
num1 = num2 = num3 = 10
num11, num22 = 10, 30

# 交换两个变量的值
a = 10
b = 20
a, b = b, a
print(a, b)

for x in range(10):
    for y in range(10):
        print(x,y)
    break


# 2.表达式0x13&0x17的值是
"""
00010011
00010111
00010011
0x13 = 19
"""
# 3.若x=2,y=3则x&y的结果是
"""
010
011
010
"""

# 4.表达式 -97 | 120 的运算结果是
"""
11100001(原) = 10011110(反) = 10011111(补)
01111000
10011111
11111111(补) = 11111110 = 10000001 = -1
"""
# 6.设x 是一个整数（16位）.若要通过x|y使x低度8位置1，高8位不
# 变，则y的二进制数是（ 11111111）

# n = 6784，以下能够获取到7 的方法有（）
# a. n / 1000 % 100  = 6.784 % 100 = 6.784
# b. n % 1000 / 100 = 784 / 100 = 7.84
# c. n // 100 % 10 =  67 % 10 = 7
# d. n // 10 % 100 // 10 = 78//10 = 7

# 9.以下表达式 10 / 4 + 23 // 4 * 2 - 30的计算结果是：______。
# 2.5 + 10 - 30 = -17.5

num = 3
print((num % 3 ==0 or num % 7 == 0) and (not (num % 3 ==0 and num % 7 == 0)))
print((num % 3 ==0 or num % 7 == 0) and num % 21 != 0)
print((num % 3 != 0 and num % 7 == 0) or (num % 3 ==0 and num % 7 != 0))
