"""__author__ = 余婷"""

"""
飞机的功能: 左移、右移、上移、下移、发射子弹、自爆等

不使用函数的问题：1.同样的功能，相同的代码需要重复写很多次
               2.当功能发生改变了，需要修改多处代码
               
怎么解决这些问题：使用函数！
"""
# print('========左移=========')
# print('看后视镜')
# print('打左转灯')
# print('向左打方向盘')
# print('踩油门')
# print('回正方向盘')
#
# print('========右移=========')
# print('看后视镜')
# print('打右转灯')
# print('向右打方向盘')
# print('踩油门')
# print('回正方向盘')

def left():
    # print('========左移=========')
    # print('看后视镜')
    # print('打左转灯')
    # print('向左打方向盘')
    # # print('踩油门')
    # print('回正方向盘')
    print('左移')

def right():
    print('========右移=========')
    print('看后视镜')
    print('打右转灯')
    print('向右打方向盘')
    # print('踩油门')
    print('回正方向盘')


# 左移两次，右移两次，左移三次
left()
left()
right()
right()
left()
left()
left()
# print('========左移=========')
# print('看后视镜')
# print('打左转灯')
# print('向左打方向盘')
# # print('踩油门')
# print('回正方向盘')
#
# print('========左移=========')
# print('看后视镜')
# print('打左转灯')
# print('向左打方向盘')
# # print('踩油门')
# print('回正方向盘')
#
# print('========右移=========')
# print('看后视镜')
# print('打右转灯')
# print('向右打方向盘')
# print('踩油门')
# print('回正方向盘')
#
# print('========右移=========')
# print('看后视镜')
# print('打右转灯')
# print('向右打方向盘')
# print('踩油门')
# print('回正方向盘')
#
# print('========左移=========')
# print('看后视镜')
# print('打左转灯')
# print('向左打方向盘')
# # print('踩油门')
# print('回正方向盘')
#
# print('========左移=========')
# print('看后视镜')
# print('打左转灯')
# print('向左打方向盘')
# # print('踩油门')
# print('回正方向盘')
#
# print('========左移=========')
# print('看后视镜')
# print('打左转灯')
# print('向左打方向盘')
# # print('踩油门')
# print('回正方向盘')